#include <iostream>
using namespace std;
int main() {
	srand(time(NULL));
	setlocale(0, "");

	int y[5]{ 1,1,1,3,0 };
	while (true) {
		cout << "\t\t\t\t\t[+] Меню\n\n\t\t\t\t\t[1] Играть\n\t\t\t\t\t[2] Правила\n\t\t\t\t\t[3] Настройки\n\t\t\t\t\t[x] Выйти\n\n\t\t\t\t\t[+] Ввод: ";
		int x;
		cin >> x;
		system("cls");
		switch (x) {
		case 1: {
			switch (y[1]) {
			case 1: {
				int z[9]{ 0,0,0,0,0,0,0,0,0 }, wx = 0, wy = 0;
				while (true) {
					system("cls");
					for (int i = 1;i < 10;i++) {
						switch (z[i - 1]) {
						case 1: {
							switch (y[3]) {
							case 1: {
								cout << "\x1b[34m";
								break;
							}
							case 2: {
								cout << "\x1b[32m";
								break;
							}
							case 3: {
								cout << "\x1b[35m";
								break;
							}
							}
							cout << "X \x1b[0m";
							break;
						}
						case 2: {
							switch (y[2]) {
							case 1: {
								cout << "\x1b[34m";
								break;
							}
							case 2: {
								cout << "\x1b[32m";
								break;
							}
							case 3: {
								cout << "\x1b[35m";
								break;
							}
							}
							cout << "O \x1b[0m";
							break;
						}
						default: {
							cout << "- ";
						}
						}
						if (i % 3 == 0)
							cout << endl;
					}
					if (z[0] == 1 && z[1] == 1 && z[2] == 1 ||
						z[3] == 1 && z[4] == 1 && z[5] == 1 ||
						z[6] == 1 && z[7] == 1 && z[8] == 1 ||
						z[0] == 1 && z[4] == 1 && z[8] == 1 ||
						z[2] == 1 && z[4] == 1 && z[6] == 1 ||
						z[0] == 1 && z[3] == 1 && z[6] == 1 ||
						z[1] == 1 && z[4] == 1 && z[7] == 1 ||
						z[2] == 1 && z[5] == 1 && z[8] == 1) {
						cout << "\n[+] Крестики выйграли\n";
						system("pause");
						break;
					}
					else
						if (z[0] == 2 && z[1] == 2 && z[2] == 2 ||
							z[3] == 2 && z[4] == 2 && z[5] == 2 ||
							z[6] == 2 && z[7] == 2 && z[8] == 2 ||
							z[0] == 2 && z[4] == 2 && z[8] == 2 ||
							z[2] == 2 && z[4] == 2 && z[6] == 2 ||
							z[0] == 2 && z[3] == 2 && z[6] == 2 ||
							z[1] == 2 && z[4] == 2 && z[7] == 2 ||
							z[2] == 2 && z[5] == 2 && z[8] == 2) {
							cout << "\n[+] Нолики выйграли\n";
							system("pause");
							break;
						}
						else {
							for (int i2 = 0;i2 < 9;i2++) {
								if (z[i2] == 0)
									break;
								else if (i2 == 8) {
									cout << "\n[+] Победителя нет\n";
									system("pause");
									wy = 1;
									break;
								}
							}
						}
					if (wy == 1)
						break;
					if (wx == 0) {
						cout << "Ввод: ";
						cin >> x;
						if (x > 0 && x < 10 && z[x - 1] == 0) {
							z[x - 1] = 1;
							wx = 1;
							continue;
						}
						else
							continue;
					}
					if (y[0] == 1)
						while (true) {
							x = rand() % 9;
							if (z[x] == 0) {
								wx = 0;
								z[x] = 2;
								break;
							}
							else
								continue;
						}
					else {
						cout << "Ввод: ";
						cin >> x;
						if (x > 0 && x < 10 && z[x - 1] == 0) {
							z[x - 1] = 2;
							wx = 0;
						}
						else
						{
							continue;
						}
					}
					system("cls");
				}
				break;
			}
			case 2: {
				int z[16]{ 0,0,0,0,0,0,0,0,0 }, wx = 0, wy = 0;
				while (true) {
					system("cls");
					for (int i = 1;i < 17;i++) {
						switch (z[i - 1]) {
						case 1: {
							switch (y[3]) {
							case 1: {
								cout << "\x1b[34m";
								break;
							}
							case 2: {
								cout << "\x1b[32m";
								break;
							}
							case 3: {
								cout << "\x1b[35m";
								break;
							}
							}
							cout << "X \x1b[0m";
							break;
						}
						case 2: {
							switch (y[2]) {
							case 1: {
								cout << "\x1b[34m";
								break;
							}
							case 2: {
								cout << "\x1b[32m";
								break;
							}
							case 3: {
								cout << "\x1b[35m";
								break;
							}
							}
							cout << "O \x1b[0m";
							break;
						}
						default: {
							cout << "- ";
						}
						}
						if (i % 4 == 0)
							cout << endl;
					}
					if (z[0] == 1 && z[1] == 1 && z[2] == 1 ||
						z[4] == 1 && z[5] == 1 && z[6] == 1 ||
						z[8] == 1 && z[9] == 1 && z[10] == 1 ||
						z[0] == 1 && z[5] == 1 && z[10] == 1 ||
						z[2] == 1 && z[5] == 1 && z[8] == 1 ||
						z[0] == 1 && z[4] == 1 && z[8] == 1 ||
						z[1] == 1 && z[5] == 1 && z[9] == 1 ||
						z[2] == 1 && z[6] == 1 && z[10] == 1 ||
						z[1] == 1 && z[2] == 1 && z[3] == 1 ||
						z[5] == 1 && z[6] == 1 && z[7] == 1 ||
						z[2] == 1 && z[5] == 1 && z[8] == 1 ||
						z[9] == 1 && z[10] == 1 && z[11] == 1 ||
						z[13] == 1 && z[14] == 1 && z[15] == 1 ||
						z[12] == 1 && z[13] == 1 && z[14] == 1 ||
						z[1] == 1 && z[6] == 1 && z[11] == 1 ||
						z[3] == 1 && z[6] == 1 && z[9] == 1 ||
						z[4] == 1 && z[9] == 1 && z[14] == 1 ||
						z[6] == 1 && z[9] == 1 && z[12] == 1 ||
						z[5] == 1 && z[10] == 1 && z[15] == 1 ||
						z[7] == 1 && z[10] == 1 && z[13] == 1 ||
						z[3] == 1 && z[7] == 1 && z[11] == 1 ||
						z[4] == 1 && z[8] == 1 && z[12] == 1 ||
						z[5] == 1 && z[9] == 1 && z[13] == 1 ||
						z[6] == 1 && z[10] == 1 && z[14] == 1 ||
						z[7] == 1 && z[11] == 1 && z[15] == 1) {
						cout << "\n[+] Крестики выйграли\n";
						system("pause");
						break;
					}
					else
						if (z[0] == 2 && z[1] == 2 && z[2] == 2 ||
							z[4] == 2 && z[5] == 2 && z[6] == 2 ||
							z[8] == 2 && z[9] == 2 && z[10] == 2 ||
							z[0] == 2 && z[5] == 2 && z[10] == 2 ||
							z[2] == 2 && z[5] == 2 && z[8] == 2 ||
							z[0] == 2 && z[4] == 2 && z[8] == 2 ||
							z[1] == 2 && z[5] == 2 && z[9] == 2 ||
							z[2] == 2 && z[6] == 2 && z[10] == 2 ||
							z[1] == 2 && z[2] == 2 && z[3] == 2 ||
							z[5] == 2 && z[6] == 2 && z[7] == 2 ||
							z[2] == 2 && z[5] == 2 && z[8] == 2 ||
							z[9] == 2 && z[10] == 2 && z[11] == 2 ||
							z[13] == 2 && z[14] == 2 && z[15] == 2 ||
							z[12] == 2 && z[13] == 2 && z[14] == 2 ||
							z[1] == 2 && z[6] == 2 && z[11] == 2 ||
							z[3] == 2 && z[6] == 2 && z[9] == 2 ||
							z[4] == 2 && z[9] == 2 && z[14] == 2 ||
							z[6] == 2 && z[9] == 2 && z[12] == 2 ||
							z[5] == 2 && z[10] == 2 && z[15] == 2 ||
							z[7] == 2 && z[10] == 2 && z[13] == 2 ||
							z[3] == 2 && z[7] == 2 && z[11] == 2 ||
							z[4] == 2 && z[8] == 2 && z[12] == 2 ||
							z[5] == 2 && z[9] == 2 && z[13] == 2 ||
							z[6] == 2 && z[10] == 2 && z[14] == 2 ||
							z[7] == 2 && z[11] == 2 && z[15] == 2) {
							cout << "\n[+] Нолики выйграли\n";
							system("pause");
							break;
						}
						else {
							for (int i2 = 0;i2 < 16;i2++) {
								if (z[i2] == 0)
									break;
								else if (i2 == 15) {
									cout << "\n[+] Победителя нет\n";
									system("pause");
									wy = 1;
									break;
								}
							}
						}
					if (wy == 1)
						break;
					if (wx == 0) {
						cout << "Ввод: ";
						cin >> x;
						if (x > 0 && x < 17 && z[x - 1] == 0) {
							z[x - 1] = 1;
							wx = 1;
							continue;
						}
						else
							continue;
					}
					if (y[0] == 1)
						while (true) {
							x = rand() % 16;
							if (z[x] == 0) {
								wx = 0;
								z[x] = 2;
								break;
							}
							else
								continue;
						}
					else {
						cout << "Ввод: ";
						cin >> x;
						if (x > 0 && x < 17 && z[x - 1] == 0) {
							z[x - 1] = 2;
							wx = 0;
						}
						else
						{
							continue;
						}
					}
					system("cls");
				}
				break;
			}
			case 3: {
				int z[25]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }, wx = 0, wy = 0;
				while (true) {
					system("cls");
					for (int i = 1;i < 26;i++) {
						switch (z[i - 1]) {
						case 1: {
							switch (y[3]) {
							case 1: {
								cout << "\x1b[34m";
								break;
							}
							case 2: {
								cout << "\x1b[32m";
								break;
							}
							case 3: {
								cout << "\x1b[35m";
								break;
							}
							}
							cout << "X \x1b[0m";
							break;
						}
						case 2: {
							switch (y[2]) {
							case 1: {
								cout << "\x1b[34m";
								break;
							}
							case 2: {
								cout << "\x1b[32m";
								break;
							}
							case 3: {
								cout << "\x1b[35m";
								break;
							}
							}
							cout << "O \x1b[0m";
							break;
						}
						default: {
							cout << "- ";
						}
						}
						if (i % 5 == 0)
							cout << endl;
					}
					if (z[0] == 1 && z[1] == 1 && z[2] == 1 ||
						z[0] == 1 && z[5] == 1 && z[10] == 1 ||
						z[0] == 1 && z[6] == 1 && z[12] == 1 ||
						z[1] == 1 && z[7] == 1 && z[13] == 1 ||
						z[1] == 1 && z[2] == 1 && z[3] == 1 ||
						z[1] == 1 && z[6] == 1 && z[11] == 1 ||
						z[2] == 1 && z[6] == 1 && z[10] == 1 ||
						z[2] == 1 && z[7] == 1 && z[12] == 1 ||
						z[2] == 1 && z[8] == 1 && z[14] == 1 ||
						z[2] == 1 && z[3] == 1 && z[4] == 1 ||
						z[3] == 1 && z[8] == 1 && z[13] == 1 ||
						z[3] == 1 && z[7] == 1 && z[11] == 1 ||
						z[4] == 1 && z[9] == 1 && z[14] == 1 ||
						z[4] == 1 && z[8] == 1 && z[12] == 1 ||
						z[5] == 1 && z[6] == 1 && z[7] == 1 ||
						z[5] == 1 && z[10] == 1 && z[15] == 1 ||
						z[5] == 1 && z[11] == 1 && z[17] == 1 ||
						z[6] == 1 && z[7] == 1 && z[8] == 1 ||
						z[6] == 1 && z[11] == 1 && z[16] == 1 ||
						z[6] == 1 && z[12] == 1 && z[18] == 1 ||
						z[7] == 1 && z[12] == 1 && z[17] == 1 ||
						z[7] == 1 && z[11] == 1 && z[15] == 1 ||
						z[7] == 1 && z[13] == 1 && z[19] == 1 ||
						z[8] == 1 && z[12] == 1 && z[16] == 1 ||
						z[8] == 1 && z[13] == 1 && z[18] == 1 ||
						z[9] == 1 && z[13] == 1 && z[17] == 1 ||
						z[9] == 1 && z[14] == 1 && z[19] == 1 ||
						z[10] == 1 && z[15] == 1 && z[20] == 1 ||
						z[10] == 1 && z[11] == 1 && z[12] == 1 ||
						z[10] == 1 && z[16] == 1 && z[22] == 1 ||
						z[11] == 1 && z[12] == 1 && z[13] == 1 ||
						z[11] == 1 && z[16] == 1 && z[21] == 1 ||
						z[11] == 1 && z[17] == 1 && z[23] == 1 ||
						z[12] == 1 && z[13] == 1 && z[14] == 1 ||
						z[12] == 1 && z[17] == 1 && z[22] == 1 ||
						z[12] == 1 && z[18] == 1 && z[24] == 1 ||
						z[12] == 1 && z[16] == 1 && z[20] == 1 ||
						z[13] == 1 && z[17] == 1 && z[21] == 1 ||
						z[13] == 1 && z[18] == 1 && z[23] == 1 ||
						z[13] == 1 && z[17] == 1 && z[21] == 1 ||
						z[14] == 1 && z[18] == 1 && z[22] == 1 ||
						z[14] == 1 && z[19] == 1 && z[24] == 1 ||
						z[15] == 1 && z[16] == 1 && z[17] == 1 ||
						z[16] == 1 && z[17] == 1 && z[18] == 1 ||
						z[17] == 1 && z[18] == 1 && z[19] == 1 ||
						z[20] == 1 && z[21] == 1 && z[22] == 1 ||
						z[21] == 1 && z[22] == 1 && z[23] == 1 ||
						z[22] == 1 && z[23] == 1 && z[24] == 1
						) {
						cout << "\n[+] Крестики выйграли\n";
						system("pause");
						break;
					}
					else
						if (z[0] == 2 && z[1] == 2 && z[2] == 2 ||
							z[0] == 2 && z[5] == 2 && z[10] == 2 ||
							z[0] == 2 && z[6] == 2 && z[12] == 2 ||
							z[1] == 2 && z[7] == 2 && z[13] == 2 ||
							z[1] == 2 && z[2] == 2 && z[3] == 2 ||
							z[1] == 2 && z[6] == 2 && z[11] == 2 ||
							z[2] == 2 && z[6] == 2 && z[10] == 2 ||
							z[2] == 2 && z[7] == 2 && z[12] == 2 ||
							z[2] == 2 && z[8] == 2 && z[14] == 2 ||
							z[2] == 2 && z[3] == 2 && z[4] == 2 ||
							z[3] == 2 && z[8] == 2 && z[13] == 2 ||
							z[3] == 2 && z[7] == 2 && z[11] == 2 ||
							z[4] == 2 && z[9] == 2 && z[14] == 2 ||
							z[4] == 2 && z[8] == 2 && z[12] == 2 ||
							z[5] == 2 && z[6] == 2 && z[7] == 2 ||
							z[5] == 2 && z[10] == 2 && z[15] == 2 ||
							z[5] == 2 && z[11] == 2 && z[17] == 2 ||
							z[6] == 2 && z[7] == 2 && z[8] == 2 ||
							z[6] == 2 && z[11] == 2 && z[16] == 2 ||
							z[6] == 2 && z[12] == 2 && z[18] == 2 ||
							z[7] == 2 && z[12] == 2 && z[17] == 2 ||
							z[7] == 2 && z[11] == 2 && z[15] == 2 ||
							z[7] == 2 && z[13] == 2 && z[19] == 2 ||
							z[8] == 2 && z[12] == 2 && z[16] == 2 ||
							z[8] == 2 && z[13] == 2 && z[18] == 2 ||
							z[9] == 2 && z[13] == 2 && z[17] == 2 ||
							z[9] == 2 && z[14] == 2 && z[19] == 2 ||
							z[10] == 2 && z[15] == 2 && z[20] == 2 ||
							z[10] == 2 && z[11] == 2 && z[12] == 2 ||
							z[10] == 2 && z[16] == 2 && z[22] == 2 ||
							z[11] == 2 && z[12] == 2 && z[13] == 2 ||
							z[11] == 2 && z[16] == 2 && z[21] == 2 ||
							z[11] == 2 && z[17] == 2 && z[23] == 2 ||
							z[12] == 2 && z[13] == 2 && z[14] == 2 ||
							z[12] == 2 && z[17] == 2 && z[22] == 2 ||
							z[12] == 2 && z[18] == 2 && z[24] == 2 ||
							z[12] == 2 && z[16] == 2 && z[20] == 2 ||
							z[13] == 2 && z[17] == 2 && z[21] == 2 ||
							z[13] == 2 && z[18] == 2 && z[23] == 2 ||
							z[13] == 2 && z[17] == 2 && z[21] == 2 ||
							z[14] == 2 && z[18] == 2 && z[22] == 2 ||
							z[14] == 2 && z[19] == 2 && z[24] == 2 ||
							z[15] == 2 && z[16] == 2 && z[17] == 2 ||
							z[16] == 2 && z[17] == 2 && z[18] == 2 ||
							z[17] == 2 && z[18] == 2 && z[19] == 2 ||
							z[20] == 2 && z[21] == 2 && z[22] == 2 ||
							z[21] == 2 && z[22] == 2 && z[23] == 2 ||
							z[22] == 2 && z[23] == 2 && z[24] == 2) {
							cout << "\n\t\t\t\t\t[+] Нолики выйграли\n";
							system("pause");
							break;
						}
						else {
							for (int i2 = 0;i2 < 9;i2++) {
								if (z[i2] == 0)
									break;
								else if (i2 == 8) {
									cout << "\n\t\t\t\t\t[+] Победителя нет\n";
									system("pause");
									wy = 1;
									break;
								}
							}
						}
					if (wy == 1)
						break;
					if (wx == 0) {
						cout << "Ввод: ";
						cin >> x;
						if (x > 0 && x < 26 && z[x - 1] == 0) {
							z[x - 1] = 1;
							wx = 1;
							continue;
						}
						else
							continue;
					}
					if (y[0] == 1)
						while (true) {
							x = rand() % 25;
							if (z[x] == 0) {
								wx = 0;
								z[x] = 2;
								break;
							}
							else
								continue;
						}
					else {
						cout << "Ввод: ";
						cin >> x;
						if (x > 0 && x < 26 && z[x - 1] == 0) {
							z[x - 1] = 2;
							wx = 0;
						}
						else
						{
							continue;
						}
					}
					system("cls");
				}
				break;
			}
			}
			break;
		}
		case 2: {
			cout << "\t\t\t\t\t[+] Правила\n";
			system("pause");
			system("cls");
			break;
		}
		case 3: {
			cout << "\t\t\t\t\t[+] Настройки\n\n\t\t\t\t\t[1] Режим игры\n\t\t\t\t\t[2] Размер карты\n\t\t\t\t\t[3] Изменить цвет нолика\n\t\t\t\t\t[4] Изменить цвет крестика\n\t\t\t\t\t[x] Выход\n\n[+] Ввод: ";
			cin >> x;
			system("cls");
			switch (x) {
			case 1: {
				cout << "\t\t\t\t\t[+] Режим игры\n\n\t\t\t\t\t[1] Против компьютера\n\t\t\t\t\t[2] Против игрока\n\n\t\t\t\t\t[+] Ввод: ";
				cin >> y[0];
				break;
			}
			case 2: {
				cout << "\t\t\t\t\t[+] Размер карты\n\n\t\t\t\t\t[1] 3x3\n\t\t\t\t\t[2] 4x4\n\t\t\t\t\t[3] 5x5ez\n\n[+] Ввод: ";
				cin >> y[1];
				break;
			}
			case 3: {
				cout << "\t\t\t\t\t[+] Изменение цвета нолика\n\n\t\t\t\t\t[1] Синий\n\t\t\t\t\t[2] Зеленый\n\t\t\t\t\t[3] Пурпурный\n\n[+] Ввод: ";
				cin >> y[2];
				break;
			}
			case 4: {
				cout << "\t\t\t\t\t[+] Изменение цвета крестика\n\n\t\t\t\t\t[1] Синий\n\t\t\t\t\t[2] Зеленый\n\t\t\t\t\t[3] Пурпурный\n\n[+] Ввод: ";
				cin >> y[3];
				break;
			}
			default: {
				break;
			}
			}
			break;
		}
		default: {
			return 0;
		}
		}
		system("cls");
	}
}
#include <iostream>
using namespace std;
int main() {
    srand(time(NULL));
    setlocale(0, "");
    int y[5]{ 1,1,0,0,0 };
    while (true) {
        cout << "[+] Меню\n\n[1] Играть\n[2] Правила\n[3] Настройки\n[x] Выйти\n\n[+] Ввод: ";
        int x;
        cin >> x;
        system("cls");
        switch (x) {
        case 1: {
            switch (y[1]) {
            case 1: {
                int z[9]{ 0,0,0,0,0,0,0,0,0 };
                while (true) {
                    for (int i = 1;i < 10;i++) {
                        cout << z[i - 1] << " ";
                        if (i % 3 == 0)
                            cout << endl;
                    }
                    cout << "Ввод: ";
                    cin >> x;
                    if (x > 0 && x < 10 && z[x - 1] == 0)
                        z[x - 1] = 1;
                    else
                        continue;
                    if (y[0] == 1)
                        while (true) {
                            x = rand() % 9;
                            if (z[x - 1] == 0) {
                                z[x - 1] = 2;
                                break;
                            }
                            else
                                continue;
                        }
                    else

                        system("pause");
                        system("cls");
                }
                
                break;
            }
            case 2: {
                int z[16]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 };
                while (true) {
                    for (int i = 1;i < 17;i++) {
                        cout << z[i - 1] << " ";
                        if (i % 4 == 0)
                            cout << endl;
                    }
                    cout << "Ввод: ";
                    cin >> x;
                    if (x > 0 && x < 16 && z[x - 1] == 0)
                        z[x - 1] = 1;
                    else
                        continue;
                    if (y[0] == 1)
                        while (true) {
                            x = rand() % 9;
                            if (z[x - 1] == 0) {
                                z[x - 1] = 2;
                                break;
                            }
                            else
                                continue;
                        }
                    else
                    system("pause");
                    system("cls");
                }
                break;
            }
            case 3: {
                int z[25]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 };
                while (true) {
                    for (int i = 1;i < 26;i++) {
                        cout << z[i - 1] << " ";
                        if (i % 5 == 0)
                            cout << endl;
                    }
                    cout << "Ввод: ";
                    cin >> x;
                    if (x > 0 && x < 25 && z[x - 1] == 0)
                        z[x - 1] = 1;
                    else
                        continue;
                    if (y[0] == 1)
                        while (true) {
                            x = rand() % 9;
                            if (z[x - 1] == 0) {
                                z[x - 1] = 2;
                                break;
                            }
                            else
                                continue;
                        }
                    else
                    system("pause");
                    system("cls");
                }
                break;
            }
            }
            break;
        }
        case 2: {
            cout << "[+] Правила\n";
            system("pause");
            system("cls");
            break;
        }
        case 3: {
            cout << "[+] Настройки\n\n[1] Режим игры\n[2] Размер карты\n[3] Изменить цвет нолика\n[4] Изменить цвет крестика\n[x] Выход\n\n[+] Ввод: ";
            cin >> x;
            system("cls");
            switch (x) {
            case 1: {
                cout << "[+] Режим игры\n\n[1] Против компьютера\n[2] Против игрока\n\n[+] Ввод: ";
                cin >> y[0];
                break;
            }
            case 2: {
                cout << "[+] Размер карты\n\n[1] 3x3\n[2] 4x4\n[3] 5x5\n\n[+] Ввод: ";
                cin >> y[1];
                break;
            }
            case 3: {
                cout << "[+] Изменение цвета нолика\n\n[1] Синий\n[2] Зеленый\n[3] Пурпурный\n\n[+] Ввод: ";
                cin >> y[2];
                switch (y[2]) {
                    //case 1:
                    case 2:
                        //if (y[2]) {

                        //}
                }
                
                break;
            }
            case 4: {
                cout << "[+] Изменение цвета крестика\n\n[1] Синий\n[2] Зеленый\n[3] Пурпурный\n\n[+] Ввод: ";
                cin >> y[3];
                break;
            }
            default: {
                break;
            }
            }
            break;
        }
        default: {
            return 0;
        }
        }
        system("cls");
    }
}